ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_flashc.h
/***************************************************************************//**
* \file cyip_flashc.h
*
* \brief
* FLASHC IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_FLASHC_H_
#define _CYIP_FLASHC_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                          FLASHC                                           ================ */
/* =========================================================================================================================== */

#define FLASHC_FM_CTL_SECTION_SIZE  0x00001000UL
#define FLASHC_SECTION_SIZE         0x00010000UL

/**
  * \brief Flash Macro Registers (FLASHC_FM_CTL)
  */
typedef struct {
  __IOM uint32_t FM_CTL;                        /*!< 0x00000000 Flash macro control                                            */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status                                                         */
  __IOM uint32_t FM_ADDR;                       /*!< 0x00000008 Flash macro  address                                           */
   __IM uint32_t GEOMETRY;                      /*!< 0x0000000C Regular flash geometry                                         */
   __IM uint32_t GEOMETRY_SUPERVISORY;          /*!< 0x00000010 Supervisory flash geometry                                     */
  __IOM uint32_t TIMER_CTL;                     /*!< 0x00000014 Timer control                                                  */
  __IOM uint32_t ANA_CTL0;                      /*!< 0x00000018 Analog control 0                                               */
  __IOM uint32_t ANA_CTL1;                      /*!< 0x0000001C Analog control 1                                               */
   __IM uint32_t GEOMETRY_GEN;                  /*!< 0x00000020 General FM Geometry Info                                       */
  __IOM uint32_t TEST_CTL;                      /*!< 0x00000024 Test mode control                                              */
  __IOM uint32_t WAIT_CTL;                      /*!< 0x00000028 Wiat State control                                             */
   __IM uint32_t MONITOR_STATUS;                /*!< 0x0000002C Monitor Status                                                 */
  __IOM uint32_t SCRATCH_CTL;                   /*!< 0x00000030 Scratch Control                                                */
  __IOM uint32_t HV_CTL;                        /*!< 0x00000034 High voltage control                                           */
   __OM uint32_t ACLK_CTL;                      /*!< 0x00000038 Aclk control                                                   */
  __IOM uint32_t INTR;                          /*!< 0x0000003C Interrupt                                                      */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000040 Interrupt set                                                  */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000044 Interrupt mask                                                 */
   __IM uint32_t INTR_MASKED;                   /*!< 0x00000048 Interrupt masked                                               */
   __OM uint32_t FM_HV_DATA_ALL;                /*!< 0x0000004C Flash macro high Voltage page latches data (for all page
                                                                latches)                                                       */
  __IOM uint32_t CAL_CTL0;                      /*!< 0x00000050 Cal control BG LO trim bits                                    */
  __IOM uint32_t CAL_CTL1;                      /*!< 0x00000054 Cal control  BG HI trim bits                                   */
  __IOM uint32_t CAL_CTL2;                      /*!< 0x00000058 Cal control BG LO&HI ipref trim, ref sel, fm_active, turbo_ext */
  __IOM uint32_t CAL_CTL3;                      /*!< 0x0000005C Cal control osc trim bits, idac, sdac, itim, bdac.             */
   __OM uint32_t BOOKMARK;                      /*!< 0x00000060 Bookmark register - keeps the current FW HV seq                */
   __IM uint32_t RESERVED[7];
  __IOM uint32_t RED_CTL01;                     /*!< 0x00000080 Redundancy Control normal sectors 0,1                          */
  __IOM uint32_t RED_CTL23;                     /*!< 0x00000084 Redundancy Controll normal sectors 2,3                         */
  __IOM uint32_t RED_CTL45;                     /*!< 0x00000088 Redundancy Controll normal sectors 4,5                         */
  __IOM uint32_t RED_CTL67;                     /*!< 0x0000008C Redundancy Controll normal sectors 6,7                         */
  __IOM uint32_t RED_CTL_SM01;                  /*!< 0x00000090 Redundancy Controll special sectors 0,1                        */
   __IM uint32_t RESERVED1[27];
   __IM uint32_t TM_CMPR[32];                   /*!< 0x00000100 Comparison between FM data out and Page Latches on each
                                                                column.                                                        */
   __IM uint32_t RESERVED2[416];
  __IOM uint32_t FM_HV_DATA[256];               /*!< 0x00000800 Flash macro high Voltage page latches data                     */
   __IM uint32_t FM_MEM_DATA[256];              /*!< 0x00000C00 Flash macro memory sense amplifier and column decoder data     */
} FLASHC_FM_CTL_Type;                           /*!< Size = 4096 (0x1000)                                                      */

/**
  * \brief Flash controller (FLASHC)
  */
typedef struct {                                /*!< FLASHC Structure                                                          */
  __IOM uint32_t FLASH_CTL;                     /*!< 0x00000000 Control                                                        */
  __IOM uint32_t FLASH_PWR_CTL;                 /*!< 0x00000004 Flash power control                                            */
  __IOM uint32_t FLASH_CMD;                     /*!< 0x00000008 Command                                                        */
   __IM uint32_t RESERVED[253];
  __IOM uint32_t CM0_CA_CTL0;                   /*!< 0x00000400 CM0+ cache control                                             */
  __IOM uint32_t CM0_CA_CTL1;                   /*!< 0x00000404 CM0+ cache control                                             */
  __IOM uint32_t CM0_CA_CMD;                    /*!< 0x00000408 CM0+ cache command                                             */
   __IM uint32_t RESERVED1[13];
   __IM uint32_t CM0_CA_STATUS0;                /*!< 0x00000440 CM0+ cache status 0                                            */
   __IM uint32_t CM0_CA_STATUS1;                /*!< 0x00000444 CM0+ cache status 1                                            */
   __IM uint32_t CM0_CA_STATUS2;                /*!< 0x00000448 CM0+ cache status 2                                            */
   __IM uint32_t RESERVED2[13];
  __IOM uint32_t CM4_CA_CTL0;                   /*!< 0x00000480 CM4 cache control                                              */
  __IOM uint32_t CM4_CA_CTL1;                   /*!< 0x00000484 CM0+ cache control                                             */
  __IOM uint32_t CM4_CA_CMD;                    /*!< 0x00000488 CM4 cache command                                              */
   __IM uint32_t RESERVED3[13];
   __IM uint32_t CM4_CA_STATUS0;                /*!< 0x000004C0 CM4 cache status 0                                             */
   __IM uint32_t CM4_CA_STATUS1;                /*!< 0x000004C4 CM4 cache status 1                                             */
   __IM uint32_t CM4_CA_STATUS2;                /*!< 0x000004C8 CM4 cache status 2                                             */
   __IM uint32_t RESERVED4[13];
  __IOM uint32_t CRYPTO_BUFF_CTL;               /*!< 0x00000500 Cryptography buffer control                                    */
   __IM uint32_t RESERVED5;
  __IOM uint32_t CRYPTO_BUFF_CMD;               /*!< 0x00000508 Cryptography buffer command                                    */
   __IM uint32_t RESERVED6[29];
  __IOM uint32_t DW0_BUFF_CTL;                  /*!< 0x00000580 Datawire 0 buffer control                                      */
   __IM uint32_t RESERVED7;
  __IOM uint32_t DW0_BUFF_CMD;                  /*!< 0x00000588 Datawire 0 buffer command                                      */
   __IM uint32_t RESERVED8[29];
  __IOM uint32_t DW1_BUFF_CTL;                  /*!< 0x00000600 Datawire 1 buffer control                                      */
   __IM uint32_t RESERVED9;
  __IOM uint32_t DW1_BUFF_CMD;                  /*!< 0x00000608 Datawire 1 buffer command                                      */
   __IM uint32_t RESERVED10[29];
  __IOM uint32_t DAP_BUFF_CTL;                  /*!< 0x00000680 Debug access port buffer control                               */
   __IM uint32_t RESERVED11;
  __IOM uint32_t DAP_BUFF_CMD;                  /*!< 0x00000688 Debug access port buffer command                               */
   __IM uint32_t RESERVED12[29];
  __IOM uint32_t EXT_MS0_BUFF_CTL;              /*!< 0x00000700 External master 0 buffer control                               */
   __IM uint32_t RESERVED13;
  __IOM uint32_t EXT_MS0_BUFF_CMD;              /*!< 0x00000708 External master 0 buffer command                               */
   __IM uint32_t RESERVED14[29];
  __IOM uint32_t EXT_MS1_BUFF_CTL;              /*!< 0x00000780 External master 1 buffer control                               */
   __IM uint32_t RESERVED15;
  __IOM uint32_t EXT_MS1_BUFF_CMD;              /*!< 0x00000788 External master 1 buffer command                               */
   __IM uint32_t RESERVED16[14877];
        FLASHC_FM_CTL_Type FM_CTL;              /*!< 0x0000F000 Flash Macro Registers                                          */
} FLASHC_Type;                                  /*!< Size = 65536 (0x10000)                                                    */


