ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_flashc.h
/* =================================================  FLASHC_FM_CTL.FM_CTL  ================================================== */
#define FLASHC_FM_CTL_FM_CTL_FM_MODE_Pos  (0UL)                 /*!< FLASHC_FM_CTL FM_CTL: FM_MODE (Bit 0)                     */
#define FLASHC_FM_CTL_FM_CTL_FM_MODE_Msk  (0xfUL)               /*!< FLASHC_FM_CTL FM_CTL: FM_MODE (Bitfield-Mask: 0x0f)       */
#define FLASHC_FM_CTL_FM_CTL_FM_SEQ_Pos   (8UL)                 /*!< FLASHC_FM_CTL FM_CTL: FM_SEQ (Bit 8)                      */
#define FLASHC_FM_CTL_FM_CTL_FM_SEQ_Msk   (0x300UL)             /*!< FLASHC_FM_CTL FM_CTL: FM_SEQ (Bitfield-Mask: 0x03)        */
#define FLASHC_FM_CTL_FM_CTL_DAA_MUX_SEL_Pos (16UL)             /*!< FLASHC_FM_CTL FM_CTL: DAA_MUX_SEL (Bit 16)                */
#define FLASHC_FM_CTL_FM_CTL_DAA_MUX_SEL_Msk (0x7f0000UL)       /*!< FLASHC_FM_CTL FM_CTL: DAA_MUX_SEL (Bitfield-Mask: 0x7f)   */
#define FLASHC_FM_CTL_FM_CTL_IF_SEL_Pos   (24UL)                /*!< FLASHC_FM_CTL FM_CTL: IF_SEL (Bit 24)                     */
#define FLASHC_FM_CTL_FM_CTL_IF_SEL_Msk   (0x1000000UL)         /*!< FLASHC_FM_CTL FM_CTL: IF_SEL (Bitfield-Mask: 0x01)        */
#define FLASHC_FM_CTL_FM_CTL_WR_EN_Pos    (25UL)                /*!< FLASHC_FM_CTL FM_CTL: WR_EN (Bit 25)                      */
#define FLASHC_FM_CTL_FM_CTL_WR_EN_Msk    (0x2000000UL)         /*!< FLASHC_FM_CTL FM_CTL: WR_EN (Bitfield-Mask: 0x01)         */
/* =================================================  FLASHC_FM_CTL.STATUS  ================================================== */
#define FLASHC_FM_CTL_STATUS_HV_TIMER_RUNNING_Pos (0UL)         /*!< FLASHC_FM_CTL STATUS: HV_TIMER_RUNNING (Bit 0)            */
#define FLASHC_FM_CTL_STATUS_HV_TIMER_RUNNING_Msk (0x1UL)       /*!< FLASHC_FM_CTL STATUS: HV_TIMER_RUNNING (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_STATUS_HV_REGS_ISOLATED_Pos (1UL)         /*!< FLASHC_FM_CTL STATUS: HV_REGS_ISOLATED (Bit 1)            */
#define FLASHC_FM_CTL_STATUS_HV_REGS_ISOLATED_Msk (0x2UL)       /*!< FLASHC_FM_CTL STATUS: HV_REGS_ISOLATED (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_STATUS_ILLEGAL_HVOP_Pos (2UL)             /*!< FLASHC_FM_CTL STATUS: ILLEGAL_HVOP (Bit 2)                */
#define FLASHC_FM_CTL_STATUS_ILLEGAL_HVOP_Msk (0x4UL)           /*!< FLASHC_FM_CTL STATUS: ILLEGAL_HVOP (Bitfield-Mask: 0x01)  */
#define FLASHC_FM_CTL_STATUS_TURBO_N_Pos  (3UL)                 /*!< FLASHC_FM_CTL STATUS: TURBO_N (Bit 3)                     */
#define FLASHC_FM_CTL_STATUS_TURBO_N_Msk  (0x8UL)               /*!< FLASHC_FM_CTL STATUS: TURBO_N (Bitfield-Mask: 0x01)       */
#define FLASHC_FM_CTL_STATUS_WR_EN_MON_Pos (4UL)                /*!< FLASHC_FM_CTL STATUS: WR_EN_MON (Bit 4)                   */
#define FLASHC_FM_CTL_STATUS_WR_EN_MON_Msk (0x10UL)             /*!< FLASHC_FM_CTL STATUS: WR_EN_MON (Bitfield-Mask: 0x01)     */
#define FLASHC_FM_CTL_STATUS_IF_SEL_MON_Pos (5UL)               /*!< FLASHC_FM_CTL STATUS: IF_SEL_MON (Bit 5)                  */
#define FLASHC_FM_CTL_STATUS_IF_SEL_MON_Msk (0x20UL)            /*!< FLASHC_FM_CTL STATUS: IF_SEL_MON (Bitfield-Mask: 0x01)    */
/* =================================================  FLASHC_FM_CTL.FM_ADDR  ================================================= */
#define FLASHC_FM_CTL_FM_ADDR_RA_Pos      (0UL)                 /*!< FLASHC_FM_CTL FM_ADDR: RA (Bit 0)                         */
#define FLASHC_FM_CTL_FM_ADDR_RA_Msk      (0xffffUL)            /*!< FLASHC_FM_CTL FM_ADDR: RA (Bitfield-Mask: 0xffff)         */
#define FLASHC_FM_CTL_FM_ADDR_BA_Pos      (16UL)                /*!< FLASHC_FM_CTL FM_ADDR: BA (Bit 16)                        */
#define FLASHC_FM_CTL_FM_ADDR_BA_Msk      (0xff0000UL)          /*!< FLASHC_FM_CTL FM_ADDR: BA (Bitfield-Mask: 0xff)           */
#define FLASHC_FM_CTL_FM_ADDR_AXA_Pos     (24UL)                /*!< FLASHC_FM_CTL FM_ADDR: AXA (Bit 24)                       */
#define FLASHC_FM_CTL_FM_ADDR_AXA_Msk     (0x1000000UL)         /*!< FLASHC_FM_CTL FM_ADDR: AXA (Bitfield-Mask: 0x01)          */
/* ================================================  FLASHC_FM_CTL.GEOMETRY  ================================================= */
#define FLASHC_FM_CTL_GEOMETRY_WORD_SIZE_LOG2_Pos (0UL)         /*!< FLASHC_FM_CTL GEOMETRY: WORD_SIZE_LOG2 (Bit 0)            */
#define FLASHC_FM_CTL_GEOMETRY_WORD_SIZE_LOG2_Msk (0xfUL)       /*!< FLASHC_FM_CTL GEOMETRY: WORD_SIZE_LOG2 (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_GEOMETRY_PAGE_SIZE_LOG2_Pos (4UL)         /*!< FLASHC_FM_CTL GEOMETRY: PAGE_SIZE_LOG2 (Bit 4)            */
#define FLASHC_FM_CTL_GEOMETRY_PAGE_SIZE_LOG2_Msk (0xf0UL)      /*!< FLASHC_FM_CTL GEOMETRY: PAGE_SIZE_LOG2 (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_GEOMETRY_ROW_COUNT_Pos (8UL)              /*!< FLASHC_FM_CTL GEOMETRY: ROW_COUNT (Bit 8)                 */
#define FLASHC_FM_CTL_GEOMETRY_ROW_COUNT_Msk (0xffff00UL)       /*!< FLASHC_FM_CTL GEOMETRY: ROW_COUNT (Bitfield-Mask: 0xffff) */
#define FLASHC_FM_CTL_GEOMETRY_BANK_COUNT_Pos (24UL)            /*!< FLASHC_FM_CTL GEOMETRY: BANK_COUNT (Bit 24)               */
#define FLASHC_FM_CTL_GEOMETRY_BANK_COUNT_Msk (0xff000000UL)    /*!< FLASHC_FM_CTL GEOMETRY: BANK_COUNT (Bitfield-Mask: 0xff)  */
/* ==========================================  FLASHC_FM_CTL.GEOMETRY_SUPERVISORY  =========================================== */
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_WORD_SIZE_LOG2_Pos (0UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: WORD_SIZE_LOG2 (Bit 0)*/
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_WORD_SIZE_LOG2_Msk (0xfUL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: WORD_SIZE_LOG2 (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_PAGE_SIZE_LOG2_Pos (4UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: PAGE_SIZE_LOG2 (Bit 4)*/
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_PAGE_SIZE_LOG2_Msk (0xf0UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: PAGE_SIZE_LOG2 (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_ROW_COUNT_Pos (8UL)  /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: ROW_COUNT (Bit 8)     */
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_ROW_COUNT_Msk (0xffff00UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: ROW_COUNT (Bitfield-Mask: 0xffff)*/
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_BANK_COUNT_Pos (24UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: BANK_COUNT (Bit 24)  */
#define FLASHC_FM_CTL_GEOMETRY_SUPERVISORY_BANK_COUNT_Msk (0xff000000UL) /*!< FLASHC_FM_CTL GEOMETRY_SUPERVISORY: BANK_COUNT (Bitfield-Mask: 0xff)*/
/* ================================================  FLASHC_FM_CTL.TIMER_CTL  ================================================ */
#define FLASHC_FM_CTL_TIMER_CTL_PERIOD_Pos (0UL)                /*!< FLASHC_FM_CTL TIMER_CTL: PERIOD (Bit 0)                   */
#define FLASHC_FM_CTL_TIMER_CTL_PERIOD_Msk (0xffffUL)           /*!< FLASHC_FM_CTL TIMER_CTL: PERIOD (Bitfield-Mask: 0xffff)   */
#define FLASHC_FM_CTL_TIMER_CTL_SCALE_Pos (16UL)                /*!< FLASHC_FM_CTL TIMER_CTL: SCALE (Bit 16)                   */
#define FLASHC_FM_CTL_TIMER_CTL_SCALE_Msk (0x10000UL)           /*!< FLASHC_FM_CTL TIMER_CTL: SCALE (Bitfield-Mask: 0x01)      */
#define FLASHC_FM_CTL_TIMER_CTL_PUMP_CLOCK_SEL_Pos (24UL)       /*!< FLASHC_FM_CTL TIMER_CTL: PUMP_CLOCK_SEL (Bit 24)          */
#define FLASHC_FM_CTL_TIMER_CTL_PUMP_CLOCK_SEL_Msk (0x1000000UL) /*!< FLASHC_FM_CTL TIMER_CTL: PUMP_CLOCK_SEL (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_TIMER_CTL_PRE_PROG_Pos (25UL)             /*!< FLASHC_FM_CTL TIMER_CTL: PRE_PROG (Bit 25)                */
#define FLASHC_FM_CTL_TIMER_CTL_PRE_PROG_Msk (0x2000000UL)      /*!< FLASHC_FM_CTL TIMER_CTL: PRE_PROG (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_TIMER_CTL_PRE_PROG_CSL_Pos (26UL)         /*!< FLASHC_FM_CTL TIMER_CTL: PRE_PROG_CSL (Bit 26)            */
#define FLASHC_FM_CTL_TIMER_CTL_PRE_PROG_CSL_Msk (0x4000000UL)  /*!< FLASHC_FM_CTL TIMER_CTL: PRE_PROG_CSL (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_TIMER_CTL_PUMP_EN_Pos (29UL)              /*!< FLASHC_FM_CTL TIMER_CTL: PUMP_EN (Bit 29)                 */
#define FLASHC_FM_CTL_TIMER_CTL_PUMP_EN_Msk (0x20000000UL)      /*!< FLASHC_FM_CTL TIMER_CTL: PUMP_EN (Bitfield-Mask: 0x01)    */
#define FLASHC_FM_CTL_TIMER_CTL_ACLK_EN_Pos (30UL)              /*!< FLASHC_FM_CTL TIMER_CTL: ACLK_EN (Bit 30)                 */
#define FLASHC_FM_CTL_TIMER_CTL_ACLK_EN_Msk (0x40000000UL)      /*!< FLASHC_FM_CTL TIMER_CTL: ACLK_EN (Bitfield-Mask: 0x01)    */
#define FLASHC_FM_CTL_TIMER_CTL_TIMER_EN_Pos (31UL)             /*!< FLASHC_FM_CTL TIMER_CTL: TIMER_EN (Bit 31)                */
#define FLASHC_FM_CTL_TIMER_CTL_TIMER_EN_Msk (0x80000000UL)     /*!< FLASHC_FM_CTL TIMER_CTL: TIMER_EN (Bitfield-Mask: 0x01)   */
/* ================================================  FLASHC_FM_CTL.ANA_CTL0  ================================================= */
#define FLASHC_FM_CTL_ANA_CTL0_CSLDAC_Pos (8UL)                 /*!< FLASHC_FM_CTL ANA_CTL0: CSLDAC (Bit 8)                    */
#define FLASHC_FM_CTL_ANA_CTL0_CSLDAC_Msk (0x700UL)             /*!< FLASHC_FM_CTL ANA_CTL0: CSLDAC (Bitfield-Mask: 0x07)      */
#define FLASHC_FM_CTL_ANA_CTL0_VCC_SEL_Pos (24UL)               /*!< FLASHC_FM_CTL ANA_CTL0: VCC_SEL (Bit 24)                  */
#define FLASHC_FM_CTL_ANA_CTL0_VCC_SEL_Msk (0x1000000UL)        /*!< FLASHC_FM_CTL ANA_CTL0: VCC_SEL (Bitfield-Mask: 0x01)     */
#define FLASHC_FM_CTL_ANA_CTL0_FLIP_AMUXBUS_AB_Pos (27UL)       /*!< FLASHC_FM_CTL ANA_CTL0: FLIP_AMUXBUS_AB (Bit 27)          */
#define FLASHC_FM_CTL_ANA_CTL0_FLIP_AMUXBUS_AB_Msk (0x8000000UL) /*!< FLASHC_FM_CTL ANA_CTL0: FLIP_AMUXBUS_AB (Bitfield-Mask: 0x01)*/
/* ================================================  FLASHC_FM_CTL.ANA_CTL1  ================================================= */
#define FLASHC_FM_CTL_ANA_CTL1_MDAC_Pos   (0UL)                 /*!< FLASHC_FM_CTL ANA_CTL1: MDAC (Bit 0)                      */
#define FLASHC_FM_CTL_ANA_CTL1_MDAC_Msk   (0xffUL)              /*!< FLASHC_FM_CTL ANA_CTL1: MDAC (Bitfield-Mask: 0xff)        */
#define FLASHC_FM_CTL_ANA_CTL1_PDAC_Pos   (16UL)                /*!< FLASHC_FM_CTL ANA_CTL1: PDAC (Bit 16)                     */
#define FLASHC_FM_CTL_ANA_CTL1_PDAC_Msk   (0xf0000UL)           /*!< FLASHC_FM_CTL ANA_CTL1: PDAC (Bitfield-Mask: 0x0f)        */
#define FLASHC_FM_CTL_ANA_CTL1_NDAC_Pos   (24UL)                /*!< FLASHC_FM_CTL ANA_CTL1: NDAC (Bit 24)                     */
#define FLASHC_FM_CTL_ANA_CTL1_NDAC_Msk   (0xf000000UL)         /*!< FLASHC_FM_CTL ANA_CTL1: NDAC (Bitfield-Mask: 0x0f)        */
#define FLASHC_FM_CTL_ANA_CTL1_VPROT_OVERRIDE_Pos (28UL)        /*!< FLASHC_FM_CTL ANA_CTL1: VPROT_OVERRIDE (Bit 28)           */
#define FLASHC_FM_CTL_ANA_CTL1_VPROT_OVERRIDE_Msk (0x10000000UL) /*!< FLASHC_FM_CTL ANA_CTL1: VPROT_OVERRIDE (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_ANA_CTL1_SPARE2_Pos (29UL)                /*!< FLASHC_FM_CTL ANA_CTL1: SPARE2 (Bit 29)                   */
#define FLASHC_FM_CTL_ANA_CTL1_SPARE2_Msk (0x20000000UL)        /*!< FLASHC_FM_CTL ANA_CTL1: SPARE2 (Bitfield-Mask: 0x01)      */
#define FLASHC_FM_CTL_ANA_CTL1_RST_SFT_HVPL_Pos (30UL)          /*!< FLASHC_FM_CTL ANA_CTL1: RST_SFT_HVPL (Bit 30)             */
#define FLASHC_FM_CTL_ANA_CTL1_RST_SFT_HVPL_Msk (0x40000000UL)  /*!< FLASHC_FM_CTL ANA_CTL1: RST_SFT_HVPL (Bitfield-Mask: 0x01)*/
/* ==============================================  FLASHC_FM_CTL.GEOMETRY_GEN  =============================================== */
#define FLASHC_FM_CTL_GEOMETRY_GEN_RWW_Pos (1UL)                /*!< FLASHC_FM_CTL GEOMETRY_GEN: RWW (Bit 1)                   */
#define FLASHC_FM_CTL_GEOMETRY_GEN_RWW_Msk (0x2UL)              /*!< FLASHC_FM_CTL GEOMETRY_GEN: RWW (Bitfield-Mask: 0x01)     */
#define FLASHC_FM_CTL_GEOMETRY_GEN_MAX_DOUT_WIDTH_Pos (2UL)     /*!< FLASHC_FM_CTL GEOMETRY_GEN: MAX_DOUT_WIDTH (Bit 2)        */
#define FLASHC_FM_CTL_GEOMETRY_GEN_MAX_DOUT_WIDTH_Msk (0x4UL)   /*!< FLASHC_FM_CTL GEOMETRY_GEN: MAX_DOUT_WIDTH (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_GEOMETRY_GEN_SECTOR0_SR_Pos (3UL)         /*!< FLASHC_FM_CTL GEOMETRY_GEN: SECTOR0_SR (Bit 3)            */
#define FLASHC_FM_CTL_GEOMETRY_GEN_SECTOR0_SR_Msk (0x8UL)       /*!< FLASHC_FM_CTL GEOMETRY_GEN: SECTOR0_SR (Bitfield-Mask: 0x01)*/
/* ================================================  FLASHC_FM_CTL.TEST_CTL  ================================================= */
#define FLASHC_FM_CTL_TEST_CTL_TEST_MODE_Pos (0UL)              /*!< FLASHC_FM_CTL TEST_CTL: TEST_MODE (Bit 0)                 */
#define FLASHC_FM_CTL_TEST_CTL_TEST_MODE_Msk (0x1fUL)           /*!< FLASHC_FM_CTL TEST_CTL: TEST_MODE (Bitfield-Mask: 0x1f)   */
#define FLASHC_FM_CTL_TEST_CTL_PN_CTL_Pos (8UL)                 /*!< FLASHC_FM_CTL TEST_CTL: PN_CTL (Bit 8)                    */
#define FLASHC_FM_CTL_TEST_CTL_PN_CTL_Msk (0x100UL)             /*!< FLASHC_FM_CTL TEST_CTL: PN_CTL (Bitfield-Mask: 0x01)      */
#define FLASHC_FM_CTL_TEST_CTL_TM_PE_Pos  (9UL)                 /*!< FLASHC_FM_CTL TEST_CTL: TM_PE (Bit 9)                     */
#define FLASHC_FM_CTL_TEST_CTL_TM_PE_Msk  (0x200UL)             /*!< FLASHC_FM_CTL TEST_CTL: TM_PE (Bitfield-Mask: 0x01)       */
#define FLASHC_FM_CTL_TEST_CTL_TM_DISPOS_Pos (10UL)             /*!< FLASHC_FM_CTL TEST_CTL: TM_DISPOS (Bit 10)                */
#define FLASHC_FM_CTL_TEST_CTL_TM_DISPOS_Msk (0x400UL)          /*!< FLASHC_FM_CTL TEST_CTL: TM_DISPOS (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_TEST_CTL_TM_DISNEG_Pos (11UL)             /*!< FLASHC_FM_CTL TEST_CTL: TM_DISNEG (Bit 11)                */
#define FLASHC_FM_CTL_TEST_CTL_TM_DISNEG_Msk (0x800UL)          /*!< FLASHC_FM_CTL TEST_CTL: TM_DISNEG (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_TEST_CTL_EN_CLK_MON_Pos (16UL)            /*!< FLASHC_FM_CTL TEST_CTL: EN_CLK_MON (Bit 16)               */
#define FLASHC_FM_CTL_TEST_CTL_EN_CLK_MON_Msk (0x10000UL)       /*!< FLASHC_FM_CTL TEST_CTL: EN_CLK_MON (Bitfield-Mask: 0x01)  */
#define FLASHC_FM_CTL_TEST_CTL_CSL_DEBUG_Pos (17UL)             /*!< FLASHC_FM_CTL TEST_CTL: CSL_DEBUG (Bit 17)                */
#define FLASHC_FM_CTL_TEST_CTL_CSL_DEBUG_Msk (0x20000UL)        /*!< FLASHC_FM_CTL TEST_CTL: CSL_DEBUG (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_TEST_CTL_ENABLE_OSC_Pos (18UL)            /*!< FLASHC_FM_CTL TEST_CTL: ENABLE_OSC (Bit 18)               */
#define FLASHC_FM_CTL_TEST_CTL_ENABLE_OSC_Msk (0x40000UL)       /*!< FLASHC_FM_CTL TEST_CTL: ENABLE_OSC (Bitfield-Mask: 0x01)  */
#define FLASHC_FM_CTL_TEST_CTL_UNSCRAMBLE_WA_Pos (31UL)         /*!< FLASHC_FM_CTL TEST_CTL: UNSCRAMBLE_WA (Bit 31)            */
#define FLASHC_FM_CTL_TEST_CTL_UNSCRAMBLE_WA_Msk (0x80000000UL) /*!< FLASHC_FM_CTL TEST_CTL: UNSCRAMBLE_WA (Bitfield-Mask: 0x01)*/
/* ================================================  FLASHC_FM_CTL.WAIT_CTL  ================================================= */
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_MEM_RD_Pos (0UL)         /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_MEM_RD (Bit 0)            */
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_MEM_RD_Msk (0xfUL)       /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_MEM_RD (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_HV_RD_Pos (8UL)          /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_HV_RD (Bit 8)             */
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_HV_RD_Msk (0xf00UL)      /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_HV_RD (Bitfield-Mask: 0x0f)*/
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_HV_WR_Pos (16UL)         /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_HV_WR (Bit 16)            */
#define FLASHC_FM_CTL_WAIT_CTL_WAIT_FM_HV_WR_Msk (0x70000UL)    /*!< FLASHC_FM_CTL WAIT_CTL: WAIT_FM_HV_WR (Bitfield-Mask: 0x07)*/
/* =============================================  FLASHC_FM_CTL.MONITOR_STATUS  ============================================== */
#define FLASHC_FM_CTL_MONITOR_STATUS_NEG_PUMP_VLO_Pos (1UL)     /*!< FLASHC_FM_CTL MONITOR_STATUS: NEG_PUMP_VLO (Bit 1)        */
#define FLASHC_FM_CTL_MONITOR_STATUS_NEG_PUMP_VLO_Msk (0x2UL)   /*!< FLASHC_FM_CTL MONITOR_STATUS: NEG_PUMP_VLO (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_MONITOR_STATUS_POS_PUMP_VHI_Pos (2UL)     /*!< FLASHC_FM_CTL MONITOR_STATUS: POS_PUMP_VHI (Bit 2)        */
#define FLASHC_FM_CTL_MONITOR_STATUS_POS_PUMP_VHI_Msk (0x4UL)   /*!< FLASHC_FM_CTL MONITOR_STATUS: POS_PUMP_VHI (Bitfield-Mask: 0x01)*/
/* ===============================================  FLASHC_FM_CTL.SCRATCH_CTL  =============================================== */
#define FLASHC_FM_CTL_SCRATCH_CTL_DUMMY32_Pos (0UL)             /*!< FLASHC_FM_CTL SCRATCH_CTL: DUMMY32 (Bit 0)                */
#define FLASHC_FM_CTL_SCRATCH_CTL_DUMMY32_Msk (0xffffffffUL)    /*!< FLASHC_FM_CTL SCRATCH_CTL: DUMMY32 (Bitfield-Mask: 0xffffffff)*/
/* =================================================  FLASHC_FM_CTL.HV_CTL  ================================================== */
#define FLASHC_FM_CTL_HV_CTL_TIMER_CLOCK_FREQ_Pos (0UL)         /*!< FLASHC_FM_CTL HV_CTL: TIMER_CLOCK_FREQ (Bit 0)            */
#define FLASHC_FM_CTL_HV_CTL_TIMER_CLOCK_FREQ_Msk (0xffUL)      /*!< FLASHC_FM_CTL HV_CTL: TIMER_CLOCK_FREQ (Bitfield-Mask: 0xff)*/
/* ================================================  FLASHC_FM_CTL.ACLK_CTL  ================================================= */
#define FLASHC_FM_CTL_ACLK_CTL_ACLK_GEN_Pos (0UL)               /*!< FLASHC_FM_CTL ACLK_CTL: ACLK_GEN (Bit 0)                  */
#define FLASHC_FM_CTL_ACLK_CTL_ACLK_GEN_Msk (0x1UL)             /*!< FLASHC_FM_CTL ACLK_CTL: ACLK_GEN (Bitfield-Mask: 0x01)    */
/* ==================================================  FLASHC_FM_CTL.INTR  =================================================== */
#define FLASHC_FM_CTL_INTR_TIMER_EXPIRED_Pos (0UL)              /*!< FLASHC_FM_CTL INTR: TIMER_EXPIRED (Bit 0)                 */
#define FLASHC_FM_CTL_INTR_TIMER_EXPIRED_Msk (0x1UL)            /*!< FLASHC_FM_CTL INTR: TIMER_EXPIRED (Bitfield-Mask: 0x01)   */
/* ================================================  FLASHC_FM_CTL.INTR_SET  ================================================= */
#define FLASHC_FM_CTL_INTR_SET_TIMER_EXPIRED_Pos (0UL)          /*!< FLASHC_FM_CTL INTR_SET: TIMER_EXPIRED (Bit 0)             */
#define FLASHC_FM_CTL_INTR_SET_TIMER_EXPIRED_Msk (0x1UL)        /*!< FLASHC_FM_CTL INTR_SET: TIMER_EXPIRED (Bitfield-Mask: 0x01)*/
/* ================================================  FLASHC_FM_CTL.INTR_MASK  ================================================ */
#define FLASHC_FM_CTL_INTR_MASK_TIMER_EXPIRED_Pos (0UL)         /*!< FLASHC_FM_CTL INTR_MASK: TIMER_EXPIRED (Bit 0)            */
#define FLASHC_FM_CTL_INTR_MASK_TIMER_EXPIRED_Msk (0x1UL)       /*!< FLASHC_FM_CTL INTR_MASK: TIMER_EXPIRED (Bitfield-Mask: 0x01)*/
/* ===============================================  FLASHC_FM_CTL.INTR_MASKED  =============================================== */
#define FLASHC_FM_CTL_INTR_MASKED_TIMER_EXPIRED_Pos (0UL)       /*!< FLASHC_FM_CTL INTR_MASKED: TIMER_EXPIRED (Bit 0)          */
#define FLASHC_FM_CTL_INTR_MASKED_TIMER_EXPIRED_Msk (0x1UL)     /*!< FLASHC_FM_CTL INTR_MASKED: TIMER_EXPIRED (Bitfield-Mask: 0x01)*/
/* =============================================  FLASHC_FM_CTL.FM_HV_DATA_ALL  ============================================== */
#define FLASHC_FM_CTL_FM_HV_DATA_ALL_DATA32_Pos (0UL)           /*!< FLASHC_FM_CTL FM_HV_DATA_ALL: DATA32 (Bit 0)              */
#define FLASHC_FM_CTL_FM_HV_DATA_ALL_DATA32_Msk (0xffffffffUL)  /*!< FLASHC_FM_CTL FM_HV_DATA_ALL: DATA32 (Bitfield-Mask: 0xffffffff)*/
/* ================================================  FLASHC_FM_CTL.CAL_CTL0  ================================================= */
#define FLASHC_FM_CTL_CAL_CTL0_VCT_TRIM_LO_HV_Pos (0UL)         /*!< FLASHC_FM_CTL CAL_CTL0: VCT_TRIM_LO_HV (Bit 0)            */
#define FLASHC_FM_CTL_CAL_CTL0_VCT_TRIM_LO_HV_Msk (0x1fUL)      /*!< FLASHC_FM_CTL CAL_CTL0: VCT_TRIM_LO_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL0_CDAC_LO_HV_Pos (5UL)             /*!< FLASHC_FM_CTL CAL_CTL0: CDAC_LO_HV (Bit 5)                */
#define FLASHC_FM_CTL_CAL_CTL0_CDAC_LO_HV_Msk (0xe0UL)          /*!< FLASHC_FM_CTL CAL_CTL0: CDAC_LO_HV (Bitfield-Mask: 0x07)  */
#define FLASHC_FM_CTL_CAL_CTL0_VBG_TRIM_LO_HV_Pos (8UL)         /*!< FLASHC_FM_CTL CAL_CTL0: VBG_TRIM_LO_HV (Bit 8)            */
#define FLASHC_FM_CTL_CAL_CTL0_VBG_TRIM_LO_HV_Msk (0x1f00UL)    /*!< FLASHC_FM_CTL CAL_CTL0: VBG_TRIM_LO_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL0_VBG_TC_TRIM_LO_HV_Pos (13UL)     /*!< FLASHC_FM_CTL CAL_CTL0: VBG_TC_TRIM_LO_HV (Bit 13)        */
#define FLASHC_FM_CTL_CAL_CTL0_VBG_TC_TRIM_LO_HV_Msk (0xe000UL) /*!< FLASHC_FM_CTL CAL_CTL0: VBG_TC_TRIM_LO_HV (Bitfield-Mask: 0x07)*/
#define FLASHC_FM_CTL_CAL_CTL0_IPREF_TRIM_LO_HV_Pos (16UL)      /*!< FLASHC_FM_CTL CAL_CTL0: IPREF_TRIM_LO_HV (Bit 16)         */
#define FLASHC_FM_CTL_CAL_CTL0_IPREF_TRIM_LO_HV_Msk (0xf0000UL) /*!< FLASHC_FM_CTL CAL_CTL0: IPREF_TRIM_LO_HV (Bitfield-Mask: 0x0f)*/
/* ================================================  FLASHC_FM_CTL.CAL_CTL1  ================================================= */
#define FLASHC_FM_CTL_CAL_CTL1_VCT_TRIM_HI_HV_Pos (0UL)         /*!< FLASHC_FM_CTL CAL_CTL1: VCT_TRIM_HI_HV (Bit 0)            */
#define FLASHC_FM_CTL_CAL_CTL1_VCT_TRIM_HI_HV_Msk (0x1fUL)      /*!< FLASHC_FM_CTL CAL_CTL1: VCT_TRIM_HI_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL1_CDAC_HI_HV_Pos (5UL)             /*!< FLASHC_FM_CTL CAL_CTL1: CDAC_HI_HV (Bit 5)                */
#define FLASHC_FM_CTL_CAL_CTL1_CDAC_HI_HV_Msk (0xe0UL)          /*!< FLASHC_FM_CTL CAL_CTL1: CDAC_HI_HV (Bitfield-Mask: 0x07)  */
#define FLASHC_FM_CTL_CAL_CTL1_VBG_TRIM_HI_HV_Pos (8UL)         /*!< FLASHC_FM_CTL CAL_CTL1: VBG_TRIM_HI_HV (Bit 8)            */
#define FLASHC_FM_CTL_CAL_CTL1_VBG_TRIM_HI_HV_Msk (0x1f00UL)    /*!< FLASHC_FM_CTL CAL_CTL1: VBG_TRIM_HI_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL1_VBG_TC_TRIM_HI_HV_Pos (13UL)     /*!< FLASHC_FM_CTL CAL_CTL1: VBG_TC_TRIM_HI_HV (Bit 13)        */
#define FLASHC_FM_CTL_CAL_CTL1_VBG_TC_TRIM_HI_HV_Msk (0xe000UL) /*!< FLASHC_FM_CTL CAL_CTL1: VBG_TC_TRIM_HI_HV (Bitfield-Mask: 0x07)*/
#define FLASHC_FM_CTL_CAL_CTL1_IPREF_TRIM_HI_HV_Pos (16UL)      /*!< FLASHC_FM_CTL CAL_CTL1: IPREF_TRIM_HI_HV (Bit 16)         */
#define FLASHC_FM_CTL_CAL_CTL1_IPREF_TRIM_HI_HV_Msk (0xf0000UL) /*!< FLASHC_FM_CTL CAL_CTL1: IPREF_TRIM_HI_HV (Bitfield-Mask: 0x0f)*/
/* ================================================  FLASHC_FM_CTL.CAL_CTL2  ================================================= */
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TRIM_LO_HV_Pos (0UL)       /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TRIM_LO_HV (Bit 0)          */
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TRIM_LO_HV_Msk (0x1fUL)    /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TRIM_LO_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TC_TRIM_LO_HV_Pos (5UL)    /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TC_TRIM_LO_HV (Bit 5)       */
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TC_TRIM_LO_HV_Msk (0xe0UL) /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TC_TRIM_LO_HV (Bitfield-Mask: 0x07)*/
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TRIM_HI_HV_Pos (8UL)       /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TRIM_HI_HV (Bit 8)          */
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TRIM_HI_HV_Msk (0x1f00UL)  /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TRIM_HI_HV (Bitfield-Mask: 0x1f)*/
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TC_TRIM_HI_HV_Pos (13UL)   /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TC_TRIM_HI_HV (Bit 13)      */
#define FLASHC_FM_CTL_CAL_CTL2_ICREF_TC_TRIM_HI_HV_Msk (0xe000UL) /*!< FLASHC_FM_CTL CAL_CTL2: ICREF_TC_TRIM_HI_HV (Bitfield-Mask: 0x07)*/
#define FLASHC_FM_CTL_CAL_CTL2_VREF_SEL_HV_Pos (16UL)           /*!< FLASHC_FM_CTL CAL_CTL2: VREF_SEL_HV (Bit 16)              */
#define FLASHC_FM_CTL_CAL_CTL2_VREF_SEL_HV_Msk (0x10000UL)      /*!< FLASHC_FM_CTL CAL_CTL2: VREF_SEL_HV (Bitfield-Mask: 0x01) */
#define FLASHC_FM_CTL_CAL_CTL2_IREF_SEL_HV_Pos (17UL)           /*!< FLASHC_FM_CTL CAL_CTL2: IREF_SEL_HV (Bit 17)              */
#define FLASHC_FM_CTL_CAL_CTL2_IREF_SEL_HV_Msk (0x20000UL)      /*!< FLASHC_FM_CTL CAL_CTL2: IREF_SEL_HV (Bitfield-Mask: 0x01) */
