ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_flashc.h
#define FLASHC_FM_CTL_CAL_CTL2_FM_ACTIVE_HV_Pos (18UL)          /*!< FLASHC_FM_CTL CAL_CTL2: FM_ACTIVE_HV (Bit 18)             */
#define FLASHC_FM_CTL_CAL_CTL2_FM_ACTIVE_HV_Msk (0x40000UL)     /*!< FLASHC_FM_CTL CAL_CTL2: FM_ACTIVE_HV (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_CAL_CTL2_TURBO_EXT_HV_Pos (19UL)          /*!< FLASHC_FM_CTL CAL_CTL2: TURBO_EXT_HV (Bit 19)             */
#define FLASHC_FM_CTL_CAL_CTL2_TURBO_EXT_HV_Msk (0x80000UL)     /*!< FLASHC_FM_CTL CAL_CTL2: TURBO_EXT_HV (Bitfield-Mask: 0x01)*/
/* ================================================  FLASHC_FM_CTL.CAL_CTL3  ================================================= */
#define FLASHC_FM_CTL_CAL_CTL3_OSC_TRIM_HV_Pos (0UL)            /*!< FLASHC_FM_CTL CAL_CTL3: OSC_TRIM_HV (Bit 0)               */
#define FLASHC_FM_CTL_CAL_CTL3_OSC_TRIM_HV_Msk (0xfUL)          /*!< FLASHC_FM_CTL CAL_CTL3: OSC_TRIM_HV (Bitfield-Mask: 0x0f) */
#define FLASHC_FM_CTL_CAL_CTL3_OSC_RANGE_TRIM_HV_Pos (4UL)      /*!< FLASHC_FM_CTL CAL_CTL3: OSC_RANGE_TRIM_HV (Bit 4)         */
#define FLASHC_FM_CTL_CAL_CTL3_OSC_RANGE_TRIM_HV_Msk (0x10UL)   /*!< FLASHC_FM_CTL CAL_CTL3: OSC_RANGE_TRIM_HV (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_CAL_CTL3_IDAC_HV_Pos (5UL)                /*!< FLASHC_FM_CTL CAL_CTL3: IDAC_HV (Bit 5)                   */
#define FLASHC_FM_CTL_CAL_CTL3_IDAC_HV_Msk (0x1e0UL)            /*!< FLASHC_FM_CTL CAL_CTL3: IDAC_HV (Bitfield-Mask: 0x0f)     */
#define FLASHC_FM_CTL_CAL_CTL3_SDAC_HV_Pos (9UL)                /*!< FLASHC_FM_CTL CAL_CTL3: SDAC_HV (Bit 9)                   */
#define FLASHC_FM_CTL_CAL_CTL3_SDAC_HV_Msk (0x600UL)            /*!< FLASHC_FM_CTL CAL_CTL3: SDAC_HV (Bitfield-Mask: 0x03)     */
#define FLASHC_FM_CTL_CAL_CTL3_ITIM_HV_Pos (11UL)               /*!< FLASHC_FM_CTL CAL_CTL3: ITIM_HV (Bit 11)                  */
#define FLASHC_FM_CTL_CAL_CTL3_ITIM_HV_Msk (0x7800UL)           /*!< FLASHC_FM_CTL CAL_CTL3: ITIM_HV (Bitfield-Mask: 0x0f)     */
#define FLASHC_FM_CTL_CAL_CTL3_VDDHI_HV_Pos (15UL)              /*!< FLASHC_FM_CTL CAL_CTL3: VDDHI_HV (Bit 15)                 */
#define FLASHC_FM_CTL_CAL_CTL3_VDDHI_HV_Msk (0x8000UL)          /*!< FLASHC_FM_CTL CAL_CTL3: VDDHI_HV (Bitfield-Mask: 0x01)    */
#define FLASHC_FM_CTL_CAL_CTL3_TURBO_PULSEW_HV_Pos (16UL)       /*!< FLASHC_FM_CTL CAL_CTL3: TURBO_PULSEW_HV (Bit 16)          */
#define FLASHC_FM_CTL_CAL_CTL3_TURBO_PULSEW_HV_Msk (0x30000UL)  /*!< FLASHC_FM_CTL CAL_CTL3: TURBO_PULSEW_HV (Bitfield-Mask: 0x03)*/
#define FLASHC_FM_CTL_CAL_CTL3_BGLO_EN_HV_Pos (18UL)            /*!< FLASHC_FM_CTL CAL_CTL3: BGLO_EN_HV (Bit 18)               */
#define FLASHC_FM_CTL_CAL_CTL3_BGLO_EN_HV_Msk (0x40000UL)       /*!< FLASHC_FM_CTL CAL_CTL3: BGLO_EN_HV (Bitfield-Mask: 0x01)  */
#define FLASHC_FM_CTL_CAL_CTL3_BGHI_EN_HV_Pos (19UL)            /*!< FLASHC_FM_CTL CAL_CTL3: BGHI_EN_HV (Bit 19)               */
#define FLASHC_FM_CTL_CAL_CTL3_BGHI_EN_HV_Msk (0x80000UL)       /*!< FLASHC_FM_CTL CAL_CTL3: BGHI_EN_HV (Bitfield-Mask: 0x01)  */
/* ================================================  FLASHC_FM_CTL.BOOKMARK  ================================================= */
#define FLASHC_FM_CTL_BOOKMARK_BOOKMARK_Pos (0UL)               /*!< FLASHC_FM_CTL BOOKMARK: BOOKMARK (Bit 0)                  */
#define FLASHC_FM_CTL_BOOKMARK_BOOKMARK_Msk (0xffffffffUL)      /*!< FLASHC_FM_CTL BOOKMARK: BOOKMARK (Bitfield-Mask: 0xffffffff)*/
/* ================================================  FLASHC_FM_CTL.RED_CTL01  ================================================ */
#define FLASHC_FM_CTL_RED_CTL01_RED_ADDR_0_Pos (0UL)            /*!< FLASHC_FM_CTL RED_CTL01: RED_ADDR_0 (Bit 0)               */
#define FLASHC_FM_CTL_RED_CTL01_RED_ADDR_0_Msk (0xffUL)         /*!< FLASHC_FM_CTL RED_CTL01: RED_ADDR_0 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL01_RED_EN_0_Pos (8UL)              /*!< FLASHC_FM_CTL RED_CTL01: RED_EN_0 (Bit 8)                 */
#define FLASHC_FM_CTL_RED_CTL01_RED_EN_0_Msk (0x100UL)          /*!< FLASHC_FM_CTL RED_CTL01: RED_EN_0 (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_RED_CTL01_RED_ADDR_1_Pos (16UL)           /*!< FLASHC_FM_CTL RED_CTL01: RED_ADDR_1 (Bit 16)              */
#define FLASHC_FM_CTL_RED_CTL01_RED_ADDR_1_Msk (0xff0000UL)     /*!< FLASHC_FM_CTL RED_CTL01: RED_ADDR_1 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL01_RED_EN_1_Pos (24UL)             /*!< FLASHC_FM_CTL RED_CTL01: RED_EN_1 (Bit 24)                */
#define FLASHC_FM_CTL_RED_CTL01_RED_EN_1_Msk (0x1000000UL)      /*!< FLASHC_FM_CTL RED_CTL01: RED_EN_1 (Bitfield-Mask: 0x01)   */
/* ================================================  FLASHC_FM_CTL.RED_CTL23  ================================================ */
#define FLASHC_FM_CTL_RED_CTL23_RED_ADDR_2_Pos (0UL)            /*!< FLASHC_FM_CTL RED_CTL23: RED_ADDR_2 (Bit 0)               */
#define FLASHC_FM_CTL_RED_CTL23_RED_ADDR_2_Msk (0xffUL)         /*!< FLASHC_FM_CTL RED_CTL23: RED_ADDR_2 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL23_RED_EN_2_Pos (8UL)              /*!< FLASHC_FM_CTL RED_CTL23: RED_EN_2 (Bit 8)                 */
#define FLASHC_FM_CTL_RED_CTL23_RED_EN_2_Msk (0x100UL)          /*!< FLASHC_FM_CTL RED_CTL23: RED_EN_2 (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_RED_CTL23_RED_ADDR_3_Pos (16UL)           /*!< FLASHC_FM_CTL RED_CTL23: RED_ADDR_3 (Bit 16)              */
#define FLASHC_FM_CTL_RED_CTL23_RED_ADDR_3_Msk (0xff0000UL)     /*!< FLASHC_FM_CTL RED_CTL23: RED_ADDR_3 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL23_RED_EN_3_Pos (24UL)             /*!< FLASHC_FM_CTL RED_CTL23: RED_EN_3 (Bit 24)                */
#define FLASHC_FM_CTL_RED_CTL23_RED_EN_3_Msk (0x1000000UL)      /*!< FLASHC_FM_CTL RED_CTL23: RED_EN_3 (Bitfield-Mask: 0x01)   */
/* ================================================  FLASHC_FM_CTL.RED_CTL45  ================================================ */
#define FLASHC_FM_CTL_RED_CTL45_RED_ADDR_4_Pos (0UL)            /*!< FLASHC_FM_CTL RED_CTL45: RED_ADDR_4 (Bit 0)               */
#define FLASHC_FM_CTL_RED_CTL45_RED_ADDR_4_Msk (0xffUL)         /*!< FLASHC_FM_CTL RED_CTL45: RED_ADDR_4 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL45_RED_EN_4_Pos (8UL)              /*!< FLASHC_FM_CTL RED_CTL45: RED_EN_4 (Bit 8)                 */
#define FLASHC_FM_CTL_RED_CTL45_RED_EN_4_Msk (0x100UL)          /*!< FLASHC_FM_CTL RED_CTL45: RED_EN_4 (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_RED_CTL45_RED_ADDR_5_Pos (16UL)           /*!< FLASHC_FM_CTL RED_CTL45: RED_ADDR_5 (Bit 16)              */
#define FLASHC_FM_CTL_RED_CTL45_RED_ADDR_5_Msk (0xff0000UL)     /*!< FLASHC_FM_CTL RED_CTL45: RED_ADDR_5 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL45_RED_EN_5_Pos (24UL)             /*!< FLASHC_FM_CTL RED_CTL45: RED_EN_5 (Bit 24)                */
#define FLASHC_FM_CTL_RED_CTL45_RED_EN_5_Msk (0x1000000UL)      /*!< FLASHC_FM_CTL RED_CTL45: RED_EN_5 (Bitfield-Mask: 0x01)   */
/* ================================================  FLASHC_FM_CTL.RED_CTL67  ================================================ */
#define FLASHC_FM_CTL_RED_CTL67_RED_ADDR_6_Pos (0UL)            /*!< FLASHC_FM_CTL RED_CTL67: RED_ADDR_6 (Bit 0)               */
#define FLASHC_FM_CTL_RED_CTL67_RED_ADDR_6_Msk (0xffUL)         /*!< FLASHC_FM_CTL RED_CTL67: RED_ADDR_6 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL67_RED_EN_6_Pos (8UL)              /*!< FLASHC_FM_CTL RED_CTL67: RED_EN_6 (Bit 8)                 */
#define FLASHC_FM_CTL_RED_CTL67_RED_EN_6_Msk (0x100UL)          /*!< FLASHC_FM_CTL RED_CTL67: RED_EN_6 (Bitfield-Mask: 0x01)   */
#define FLASHC_FM_CTL_RED_CTL67_RED_ADDR_7_Pos (16UL)           /*!< FLASHC_FM_CTL RED_CTL67: RED_ADDR_7 (Bit 16)              */
#define FLASHC_FM_CTL_RED_CTL67_RED_ADDR_7_Msk (0xff0000UL)     /*!< FLASHC_FM_CTL RED_CTL67: RED_ADDR_7 (Bitfield-Mask: 0xff) */
#define FLASHC_FM_CTL_RED_CTL67_RED_EN_7_Pos (24UL)             /*!< FLASHC_FM_CTL RED_CTL67: RED_EN_7 (Bit 24)                */
#define FLASHC_FM_CTL_RED_CTL67_RED_EN_7_Msk (0x1000000UL)      /*!< FLASHC_FM_CTL RED_CTL67: RED_EN_7 (Bitfield-Mask: 0x01)   */
/* ==============================================  FLASHC_FM_CTL.RED_CTL_SM01  =============================================== */
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_ADDR_SM0_Pos (0UL)       /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_ADDR_SM0 (Bit 0)          */
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_ADDR_SM0_Msk (0xffUL)    /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_ADDR_SM0 (Bitfield-Mask: 0xff)*/
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_EN_SM0_Pos (8UL)         /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_EN_SM0 (Bit 8)            */
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_EN_SM0_Msk (0x100UL)     /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_EN_SM0 (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_ADDR_SM1_Pos (16UL)      /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_ADDR_SM1 (Bit 16)         */
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_ADDR_SM1_Msk (0xff0000UL) /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_ADDR_SM1 (Bitfield-Mask: 0xff)*/
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_EN_SM1_Pos (24UL)        /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_EN_SM1 (Bit 24)           */
#define FLASHC_FM_CTL_RED_CTL_SM01_RED_EN_SM1_Msk (0x1000000UL) /*!< FLASHC_FM_CTL RED_CTL_SM01: RED_EN_SM1 (Bitfield-Mask: 0x01)*/
#define FLASHC_FM_CTL_RED_CTL_SM01_TRKD_Pos (30UL)              /*!< FLASHC_FM_CTL RED_CTL_SM01: TRKD (Bit 30)                 */
#define FLASHC_FM_CTL_RED_CTL_SM01_TRKD_Msk (0x40000000UL)      /*!< FLASHC_FM_CTL RED_CTL_SM01: TRKD (Bitfield-Mask: 0x01)    */
#define FLASHC_FM_CTL_RED_CTL_SM01_R_GRANT_EN_Pos (31UL)        /*!< FLASHC_FM_CTL RED_CTL_SM01: R_GRANT_EN (Bit 31)           */
#define FLASHC_FM_CTL_RED_CTL_SM01_R_GRANT_EN_Msk (0x80000000UL) /*!< FLASHC_FM_CTL RED_CTL_SM01: R_GRANT_EN (Bitfield-Mask: 0x01)*/
/* =================================================  FLASHC_FM_CTL.TM_CMPR  ================================================= */
#define FLASHC_FM_CTL_TM_CMPR_DATA_COMP_RESULT_Pos (0UL)        /*!< FLASHC_FM_CTL TM_CMPR: DATA_COMP_RESULT (Bit 0)           */
#define FLASHC_FM_CTL_TM_CMPR_DATA_COMP_RESULT_Msk (0x1UL)      /*!< FLASHC_FM_CTL TM_CMPR: DATA_COMP_RESULT (Bitfield-Mask: 0x01)*/
/* ===============================================  FLASHC_FM_CTL.FM_HV_DATA  ================================================ */
#define FLASHC_FM_CTL_FM_HV_DATA_DATA32_Pos (0UL)               /*!< FLASHC_FM_CTL FM_HV_DATA: DATA32 (Bit 0)                  */
#define FLASHC_FM_CTL_FM_HV_DATA_DATA32_Msk (0xffffffffUL)      /*!< FLASHC_FM_CTL FM_HV_DATA: DATA32 (Bitfield-Mask: 0xffffffff)*/
/* ===============================================  FLASHC_FM_CTL.FM_MEM_DATA  =============================================== */
#define FLASHC_FM_CTL_FM_MEM_DATA_DATA32_Pos (0UL)              /*!< FLASHC_FM_CTL FM_MEM_DATA: DATA32 (Bit 0)                 */
#define FLASHC_FM_CTL_FM_MEM_DATA_DATA32_Msk (0xffffffffUL)     /*!< FLASHC_FM_CTL FM_MEM_DATA: DATA32 (Bitfield-Mask: 0xffffffff)*/


