ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_flashc.h
/* ===================================================  FLASHC.FLASH_CTL  ==================================================== */
#define FLASHC_FLASH_CTL_MAIN_WS_Pos      (0UL)                 /*!< FLASHC FLASH_CTL: MAIN_WS (Bit 0)                         */
#define FLASHC_FLASH_CTL_MAIN_WS_Msk      (0xfUL)               /*!< FLASHC FLASH_CTL: MAIN_WS (Bitfield-Mask: 0x0f)           */
#define FLASHC_FLASH_CTL_REMAP_Pos        (8UL)                 /*!< FLASHC FLASH_CTL: REMAP (Bit 8)                           */
#define FLASHC_FLASH_CTL_REMAP_Msk        (0x100UL)             /*!< FLASHC FLASH_CTL: REMAP (Bitfield-Mask: 0x01)             */
/* =================================================  FLASHC.FLASH_PWR_CTL  ================================================== */
#define FLASHC_FLASH_PWR_CTL_ENABLE_Pos   (0UL)                 /*!< FLASHC FLASH_PWR_CTL: ENABLE (Bit 0)                      */
#define FLASHC_FLASH_PWR_CTL_ENABLE_Msk   (0x1UL)               /*!< FLASHC FLASH_PWR_CTL: ENABLE (Bitfield-Mask: 0x01)        */
#define FLASHC_FLASH_PWR_CTL_ENABLE_HV_Pos (1UL)                /*!< FLASHC FLASH_PWR_CTL: ENABLE_HV (Bit 1)                   */
#define FLASHC_FLASH_PWR_CTL_ENABLE_HV_Msk (0x2UL)              /*!< FLASHC FLASH_PWR_CTL: ENABLE_HV (Bitfield-Mask: 0x01)     */
/* ===================================================  FLASHC.FLASH_CMD  ==================================================== */
#define FLASHC_FLASH_CMD_INV_Pos          (0UL)                 /*!< FLASHC FLASH_CMD: INV (Bit 0)                             */
#define FLASHC_FLASH_CMD_INV_Msk          (0x1UL)               /*!< FLASHC FLASH_CMD: INV (Bitfield-Mask: 0x01)               */
/* ==================================================  FLASHC.CM0_CA_CTL0  =================================================== */
#define FLASHC_CM0_CA_CTL0_WAY_Pos        (16UL)                /*!< FLASHC CM0_CA_CTL0: WAY (Bit 16)                          */
#define FLASHC_CM0_CA_CTL0_WAY_Msk        (0x30000UL)           /*!< FLASHC CM0_CA_CTL0: WAY (Bitfield-Mask: 0x03)             */
#define FLASHC_CM0_CA_CTL0_SET_ADDR_Pos   (24UL)                /*!< FLASHC CM0_CA_CTL0: SET_ADDR (Bit 24)                     */
#define FLASHC_CM0_CA_CTL0_SET_ADDR_Msk   (0x7000000UL)         /*!< FLASHC CM0_CA_CTL0: SET_ADDR (Bitfield-Mask: 0x07)        */
#define FLASHC_CM0_CA_CTL0_PREF_EN_Pos    (30UL)                /*!< FLASHC CM0_CA_CTL0: PREF_EN (Bit 30)                      */
#define FLASHC_CM0_CA_CTL0_PREF_EN_Msk    (0x40000000UL)        /*!< FLASHC CM0_CA_CTL0: PREF_EN (Bitfield-Mask: 0x01)         */
#define FLASHC_CM0_CA_CTL0_ENABLED_Pos    (31UL)                /*!< FLASHC CM0_CA_CTL0: ENABLED (Bit 31)                      */
#define FLASHC_CM0_CA_CTL0_ENABLED_Msk    (0x80000000UL)        /*!< FLASHC CM0_CA_CTL0: ENABLED (Bitfield-Mask: 0x01)         */
/* ==================================================  FLASHC.CM0_CA_CTL1  =================================================== */
#define FLASHC_CM0_CA_CTL1_ISOLATE_Pos    (0UL)                 /*!< FLASHC CM0_CA_CTL1: ISOLATE (Bit 0)                       */
#define FLASHC_CM0_CA_CTL1_ISOLATE_Msk    (0x1UL)               /*!< FLASHC CM0_CA_CTL1: ISOLATE (Bitfield-Mask: 0x01)         */
#define FLASHC_CM0_CA_CTL1_RETAIN_Pos     (1UL)                 /*!< FLASHC CM0_CA_CTL1: RETAIN (Bit 1)                        */
#define FLASHC_CM0_CA_CTL1_RETAIN_Msk     (0x2UL)               /*!< FLASHC CM0_CA_CTL1: RETAIN (Bitfield-Mask: 0x01)          */
#define FLASHC_CM0_CA_CTL1_POWER_Pos      (2UL)                 /*!< FLASHC CM0_CA_CTL1: POWER (Bit 2)                         */
#define FLASHC_CM0_CA_CTL1_POWER_Msk      (0x4UL)               /*!< FLASHC CM0_CA_CTL1: POWER (Bitfield-Mask: 0x01)           */
/* ===================================================  FLASHC.CM0_CA_CMD  =================================================== */
#define FLASHC_CM0_CA_CMD_INV_Pos         (0UL)                 /*!< FLASHC CM0_CA_CMD: INV (Bit 0)                            */
#define FLASHC_CM0_CA_CMD_INV_Msk         (0x1UL)               /*!< FLASHC CM0_CA_CMD: INV (Bitfield-Mask: 0x01)              */
/* =================================================  FLASHC.CM0_CA_STATUS0  ================================================= */
#define FLASHC_CM0_CA_STATUS0_VALID16_Pos (0UL)                 /*!< FLASHC CM0_CA_STATUS0: VALID16 (Bit 0)                    */
#define FLASHC_CM0_CA_STATUS0_VALID16_Msk (0xffffUL)            /*!< FLASHC CM0_CA_STATUS0: VALID16 (Bitfield-Mask: 0xffff)    */
/* =================================================  FLASHC.CM0_CA_STATUS1  ================================================= */
#define FLASHC_CM0_CA_STATUS1_TAG_Pos     (0UL)                 /*!< FLASHC CM0_CA_STATUS1: TAG (Bit 0)                        */
#define FLASHC_CM0_CA_STATUS1_TAG_Msk     (0xffffffffUL)        /*!< FLASHC CM0_CA_STATUS1: TAG (Bitfield-Mask: 0xffffffff)    */
/* =================================================  FLASHC.CM0_CA_STATUS2  ================================================= */
#define FLASHC_CM0_CA_STATUS2_LRU_Pos     (0UL)                 /*!< FLASHC CM0_CA_STATUS2: LRU (Bit 0)                        */
#define FLASHC_CM0_CA_STATUS2_LRU_Msk     (0x3fUL)              /*!< FLASHC CM0_CA_STATUS2: LRU (Bitfield-Mask: 0x3f)          */
/* ==================================================  FLASHC.CM4_CA_CTL0  =================================================== */
#define FLASHC_CM4_CA_CTL0_WAY_Pos        (16UL)                /*!< FLASHC CM4_CA_CTL0: WAY (Bit 16)                          */
#define FLASHC_CM4_CA_CTL0_WAY_Msk        (0x30000UL)           /*!< FLASHC CM4_CA_CTL0: WAY (Bitfield-Mask: 0x03)             */
#define FLASHC_CM4_CA_CTL0_SET_ADDR_Pos   (24UL)                /*!< FLASHC CM4_CA_CTL0: SET_ADDR (Bit 24)                     */
#define FLASHC_CM4_CA_CTL0_SET_ADDR_Msk   (0x7000000UL)         /*!< FLASHC CM4_CA_CTL0: SET_ADDR (Bitfield-Mask: 0x07)        */
#define FLASHC_CM4_CA_CTL0_PREF_EN_Pos    (30UL)                /*!< FLASHC CM4_CA_CTL0: PREF_EN (Bit 30)                      */
#define FLASHC_CM4_CA_CTL0_PREF_EN_Msk    (0x40000000UL)        /*!< FLASHC CM4_CA_CTL0: PREF_EN (Bitfield-Mask: 0x01)         */
#define FLASHC_CM4_CA_CTL0_ENABLED_Pos    (31UL)                /*!< FLASHC CM4_CA_CTL0: ENABLED (Bit 31)                      */
#define FLASHC_CM4_CA_CTL0_ENABLED_Msk    (0x80000000UL)        /*!< FLASHC CM4_CA_CTL0: ENABLED (Bitfield-Mask: 0x01)         */
/* ==================================================  FLASHC.CM4_CA_CTL1  =================================================== */
#define FLASHC_CM4_CA_CTL1_ISOLATE_Pos    (0UL)                 /*!< FLASHC CM4_CA_CTL1: ISOLATE (Bit 0)                       */
#define FLASHC_CM4_CA_CTL1_ISOLATE_Msk    (0x1UL)               /*!< FLASHC CM4_CA_CTL1: ISOLATE (Bitfield-Mask: 0x01)         */
#define FLASHC_CM4_CA_CTL1_RETAIN_Pos     (1UL)                 /*!< FLASHC CM4_CA_CTL1: RETAIN (Bit 1)                        */
#define FLASHC_CM4_CA_CTL1_RETAIN_Msk     (0x2UL)               /*!< FLASHC CM4_CA_CTL1: RETAIN (Bitfield-Mask: 0x01)          */
#define FLASHC_CM4_CA_CTL1_POWER_Pos      (2UL)                 /*!< FLASHC CM4_CA_CTL1: POWER (Bit 2)                         */
#define FLASHC_CM4_CA_CTL1_POWER_Msk      (0x4UL)               /*!< FLASHC CM4_CA_CTL1: POWER (Bitfield-Mask: 0x01)           */
/* ===================================================  FLASHC.CM4_CA_CMD  =================================================== */
#define FLASHC_CM4_CA_CMD_INV_Pos         (0UL)                 /*!< FLASHC CM4_CA_CMD: INV (Bit 0)                            */
#define FLASHC_CM4_CA_CMD_INV_Msk         (0x1UL)               /*!< FLASHC CM4_CA_CMD: INV (Bitfield-Mask: 0x01)              */
/* =================================================  FLASHC.CM4_CA_STATUS0  ================================================= */
#define FLASHC_CM4_CA_STATUS0_VALID16_Pos (0UL)                 /*!< FLASHC CM4_CA_STATUS0: VALID16 (Bit 0)                    */
#define FLASHC_CM4_CA_STATUS0_VALID16_Msk (0xffffUL)            /*!< FLASHC CM4_CA_STATUS0: VALID16 (Bitfield-Mask: 0xffff)    */
/* =================================================  FLASHC.CM4_CA_STATUS1  ================================================= */
#define FLASHC_CM4_CA_STATUS1_TAG_Pos     (0UL)                 /*!< FLASHC CM4_CA_STATUS1: TAG (Bit 0)                        */
#define FLASHC_CM4_CA_STATUS1_TAG_Msk     (0xffffffffUL)        /*!< FLASHC CM4_CA_STATUS1: TAG (Bitfield-Mask: 0xffffffff)    */
/* =================================================  FLASHC.CM4_CA_STATUS2  ================================================= */
#define FLASHC_CM4_CA_STATUS2_LRU_Pos     (0UL)                 /*!< FLASHC CM4_CA_STATUS2: LRU (Bit 0)                        */
#define FLASHC_CM4_CA_STATUS2_LRU_Msk     (0x3fUL)              /*!< FLASHC CM4_CA_STATUS2: LRU (Bitfield-Mask: 0x3f)          */
/* ================================================  FLASHC.CRYPTO_BUFF_CTL  ================================================= */
#define FLASHC_CRYPTO_BUFF_CTL_PREF_EN_Pos (30UL)               /*!< FLASHC CRYPTO_BUFF_CTL: PREF_EN (Bit 30)                  */
#define FLASHC_CRYPTO_BUFF_CTL_PREF_EN_Msk (0x40000000UL)       /*!< FLASHC CRYPTO_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)     */
#define FLASHC_CRYPTO_BUFF_CTL_ENABLED_Pos (31UL)               /*!< FLASHC CRYPTO_BUFF_CTL: ENABLED (Bit 31)                  */
#define FLASHC_CRYPTO_BUFF_CTL_ENABLED_Msk (0x80000000UL)       /*!< FLASHC CRYPTO_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)     */
/* ================================================  FLASHC.CRYPTO_BUFF_CMD  ================================================= */
#define FLASHC_CRYPTO_BUFF_CMD_INV_Pos    (0UL)                 /*!< FLASHC CRYPTO_BUFF_CMD: INV (Bit 0)                       */
#define FLASHC_CRYPTO_BUFF_CMD_INV_Msk    (0x1UL)               /*!< FLASHC CRYPTO_BUFF_CMD: INV (Bitfield-Mask: 0x01)         */
/* ==================================================  FLASHC.DW0_BUFF_CTL  ================================================== */
#define FLASHC_DW0_BUFF_CTL_PREF_EN_Pos   (30UL)                /*!< FLASHC DW0_BUFF_CTL: PREF_EN (Bit 30)                     */
#define FLASHC_DW0_BUFF_CTL_PREF_EN_Msk   (0x40000000UL)        /*!< FLASHC DW0_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)        */
#define FLASHC_DW0_BUFF_CTL_ENABLED_Pos   (31UL)                /*!< FLASHC DW0_BUFF_CTL: ENABLED (Bit 31)                     */
#define FLASHC_DW0_BUFF_CTL_ENABLED_Msk   (0x80000000UL)        /*!< FLASHC DW0_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)        */
/* ==================================================  FLASHC.DW0_BUFF_CMD  ================================================== */
#define FLASHC_DW0_BUFF_CMD_INV_Pos       (0UL)                 /*!< FLASHC DW0_BUFF_CMD: INV (Bit 0)                          */
#define FLASHC_DW0_BUFF_CMD_INV_Msk       (0x1UL)               /*!< FLASHC DW0_BUFF_CMD: INV (Bitfield-Mask: 0x01)            */
/* ==================================================  FLASHC.DW1_BUFF_CTL  ================================================== */
#define FLASHC_DW1_BUFF_CTL_PREF_EN_Pos   (30UL)                /*!< FLASHC DW1_BUFF_CTL: PREF_EN (Bit 30)                     */
#define FLASHC_DW1_BUFF_CTL_PREF_EN_Msk   (0x40000000UL)        /*!< FLASHC DW1_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)        */
#define FLASHC_DW1_BUFF_CTL_ENABLED_Pos   (31UL)                /*!< FLASHC DW1_BUFF_CTL: ENABLED (Bit 31)                     */
#define FLASHC_DW1_BUFF_CTL_ENABLED_Msk   (0x80000000UL)        /*!< FLASHC DW1_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)        */
/* ==================================================  FLASHC.DW1_BUFF_CMD  ================================================== */
#define FLASHC_DW1_BUFF_CMD_INV_Pos       (0UL)                 /*!< FLASHC DW1_BUFF_CMD: INV (Bit 0)                          */
#define FLASHC_DW1_BUFF_CMD_INV_Msk       (0x1UL)               /*!< FLASHC DW1_BUFF_CMD: INV (Bitfield-Mask: 0x01)            */
/* ==================================================  FLASHC.DAP_BUFF_CTL  ================================================== */
#define FLASHC_DAP_BUFF_CTL_PREF_EN_Pos   (30UL)                /*!< FLASHC DAP_BUFF_CTL: PREF_EN (Bit 30)                     */
#define FLASHC_DAP_BUFF_CTL_PREF_EN_Msk   (0x40000000UL)        /*!< FLASHC DAP_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)        */
#define FLASHC_DAP_BUFF_CTL_ENABLED_Pos   (31UL)                /*!< FLASHC DAP_BUFF_CTL: ENABLED (Bit 31)                     */
#define FLASHC_DAP_BUFF_CTL_ENABLED_Msk   (0x80000000UL)        /*!< FLASHC DAP_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)        */
/* ==================================================  FLASHC.DAP_BUFF_CMD  ================================================== */
#define FLASHC_DAP_BUFF_CMD_INV_Pos       (0UL)                 /*!< FLASHC DAP_BUFF_CMD: INV (Bit 0)                          */
#define FLASHC_DAP_BUFF_CMD_INV_Msk       (0x1UL)               /*!< FLASHC DAP_BUFF_CMD: INV (Bitfield-Mask: 0x01)            */
/* ================================================  FLASHC.EXT_MS0_BUFF_CTL  ================================================ */
#define FLASHC_EXT_MS0_BUFF_CTL_PREF_EN_Pos (30UL)              /*!< FLASHC EXT_MS0_BUFF_CTL: PREF_EN (Bit 30)                 */
#define FLASHC_EXT_MS0_BUFF_CTL_PREF_EN_Msk (0x40000000UL)      /*!< FLASHC EXT_MS0_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)    */
#define FLASHC_EXT_MS0_BUFF_CTL_ENABLED_Pos (31UL)              /*!< FLASHC EXT_MS0_BUFF_CTL: ENABLED (Bit 31)                 */
#define FLASHC_EXT_MS0_BUFF_CTL_ENABLED_Msk (0x80000000UL)      /*!< FLASHC EXT_MS0_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)    */
/* ================================================  FLASHC.EXT_MS0_BUFF_CMD  ================================================ */
#define FLASHC_EXT_MS0_BUFF_CMD_INV_Pos   (0UL)                 /*!< FLASHC EXT_MS0_BUFF_CMD: INV (Bit 0)                      */
#define FLASHC_EXT_MS0_BUFF_CMD_INV_Msk   (0x1UL)               /*!< FLASHC EXT_MS0_BUFF_CMD: INV (Bitfield-Mask: 0x01)        */
/* ================================================  FLASHC.EXT_MS1_BUFF_CTL  ================================================ */
#define FLASHC_EXT_MS1_BUFF_CTL_PREF_EN_Pos (30UL)              /*!< FLASHC EXT_MS1_BUFF_CTL: PREF_EN (Bit 30)                 */
#define FLASHC_EXT_MS1_BUFF_CTL_PREF_EN_Msk (0x40000000UL)      /*!< FLASHC EXT_MS1_BUFF_CTL: PREF_EN (Bitfield-Mask: 0x01)    */
#define FLASHC_EXT_MS1_BUFF_CTL_ENABLED_Pos (31UL)              /*!< FLASHC EXT_MS1_BUFF_CTL: ENABLED (Bit 31)                 */
#define FLASHC_EXT_MS1_BUFF_CTL_ENABLED_Msk (0x80000000UL)      /*!< FLASHC EXT_MS1_BUFF_CTL: ENABLED (Bitfield-Mask: 0x01)    */
/* ================================================  FLASHC.EXT_MS1_BUFF_CMD  ================================================ */
#define FLASHC_EXT_MS1_BUFF_CMD_INV_Pos   (0UL)                 /*!< FLASHC EXT_MS1_BUFF_CMD: INV (Bit 0)                      */
#define FLASHC_EXT_MS1_BUFF_CMD_INV_Msk   (0x1UL)               /*!< FLASHC EXT_MS1_BUFF_CMD: INV (Bitfield-Mask: 0x01)        */


#endif /* _CYIP_FLASHC_H_ */


/* [] END OF FILE */
